In [1]:
import pandas as pd
from sqlalchemy import create_engine
from IPython.display import Image
import pandas as pd
import seaborn as sns
import numpy as np
from matplotlib import pyplot as plt
from sklearn import svm,model_selection,decomposition,\
metrics,pipeline, preprocessing, neighbors, model_selection
cnx = create_engine("postgresql://ubuntu:ubuntu@localhost:5432/NY_restaurant")

In [2]:
df_dba = pd.read_csv("dba_google_addresses.csv")

In [3]:
master_df = pd.read_sql_query('''
SELECT
CASE WHEN ins.grade = 'A' THEN 0
    ELSE 1
    END
    as grade
,ins.dba
,zip."NUM_RICH"
,boro
,ins.cuisine_description
,ins.inspection_type
,concat(ins.building::text, ' ',ins.street::text,' ',zipcode,' NY') as address
,grade_date
FROM nyc_inspections ins
JOIN zip_rich_filers zip on ins.zipcode = zip."ZIP"::text
WHERE ins.grade IS NOT NULL 
AND ins.grade_date IS NOT NULL
AND ins.inspection_date != '1900-01-01' 
GROUP BY ins.camis,ins.dba,ins.grade_date,ins.grade,boro,ins.zipcode
,ins.cuisine_description,ins.inspection_type,ins.building,ins.street,zip."ZIP",zip."NUM_RICH"
ORDER BY grade_date desc
''',cnx)

In [4]:
master_df.sample(5)
# df_dba.sample(5)

,grade,dba,NUM_RICH,boro,cuisine_description,inspection_type,address,grade_date
10221,0,CASCATA,0.0,QUEENS,Sandwiches/Salads/Mixed Buffet,Cycle Inspection / Initial Inspection,NKA JFK INTL AIRPORT 11430 NY,2018-01-18
9581,1,MODERN GOURMET,13030.0,MANHATTAN,American,Cycle Inspection / Re-inspection,793 BROADWAY 10003 NY,2018-01-24
60087,1,WASABI,4280.0,BROOKLYN,Japanese,Cycle Inspection / Re-inspection,638 MANHATTAN AVE 11222 NY,2015-11-04
63427,0,FOUR & TWENTY BLACKBIRDS,12260.0,BROOKLYN,Bakery,Cycle Inspection / Re-inspection,439 3 AVENUE 11215 NY,2015-09-01
3217,0,PAPAYA DOG,13030.0,MANHATTAN,Hotdogs,Cycle Inspection / Initial Inspection,239-11 1 AVENUE 10003 NY,2018-03-28

In [5]:
new_master = master_df.merge(df_dba,how='left',left_on='address',right_on='address',suffixes=\
                             ("_master","_goog"))
new_master = new_master.drop(columns=['goog_add','dba_goog','Unnamed: 0','address'])
new_master.sample()

,grade,dba_master,NUM_RICH,boro,cuisine_description,inspection_type,grade_date,lat,lng
81912,0,PITA EXPRESS,3990.0,MANHATTAN,Jewish/Kosher,Pre-permit (Operational) / Initial Inspection,2016-03-28,40.71103,-74.007781

In [6]:
# new_master.groupby(by=['dba_master','grade_date'])['grade_date'].count()
master_df.describe()

              grade      NUM_RICH
count  79015.000000  79015.000000
mean       0.127697   5337.409859
std        0.333755   4176.076607
min        0.000000      0.000000
25%        0.000000   2230.000000
50%        0.000000   3800.000000
75%        0.000000   7210.000000
max        1.000000  17170.000000

In [7]:
master_df[master_df['dba']=="cats on the bay"]

,grade,dba,NUM_RICH,boro,cuisine_description,inspection_type,address,grade_date
38317,0,cats on the bay,5390.0,BROOKLYN,Russian,Cycle Inspection / Initial Inspection,2027 EMMONS AVE 11235 NY,2016-10-22
48114,0,cats on the bay,5390.0,BROOKLYN,Russian,Cycle Inspection / Re-inspection,2027 EMMONS AVE 11235 NY,2016-05-12
72285,0,cats on the bay,5390.0,BROOKLYN,Russian,Cycle Inspection / Initial Inspection,2027 EMMONS AVE 11235 NY,2015-04-09
78976,0,cats on the bay,5390.0,BROOKLYN,Russian,Cycle Inspection / Initial Inspection,2027 EMMONS AVE 11235 NY,2014-02-19

In [8]:
df_dba[df_dba['dba']=="cats on the bay"]

,Unnamed: 0,dba,address,lat,lng,goog_add
14766,14766,cats on the bay,2027 EMMONS AVE 11235 NY,40.584017,-73.946881,"2027 Emmons Ave, Brooklyn, NY 11235, USA"

In [9]:
test = new_master.drop_duplicates()

In [10]:
test[test['dba_master']=="cats on the bay"]

,grade,dba_master,NUM_RICH,boro,cuisine_description,inspection_type,grade_date,lat,lng
60121,0,cats on the bay,5390.0,BROOKLYN,Russian,Cycle Inspection / Initial Inspection,2016-10-22,40.584017,-73.946881
76458,0,cats on the bay,5390.0,BROOKLYN,Russian,Cycle Inspection / Re-inspection,2016-05-12,40.584017,-73.946881
115372,0,cats on the bay,5390.0,BROOKLYN,Russian,Cycle Inspection / Initial Inspection,2015-04-09,40.584017,-73.946881
126374,0,cats on the bay,5390.0,BROOKLYN,Russian,Cycle Inspection / Initial Inspection,2014-02-19,40.584017,-73.946881

In [11]:
test.to_pickle("master_5818")